## Phase 1.06 - 1.07

# SQL and Relational Databases

---

# Day 1
## What is a Database?
- In general, databases store sets of data that can be queried for use in other applications. 
- A database management system supports the development, administration and use of database platforms.


### What is a Relational Database? 
- A *relational database management system* (**RDBMS**) is a type of DBMS with a row-based table structure that connects related data elements and includes functions that maintain the security, accuracy, integrity and consistency of the data.
- The most basic **RDBMS** functions are related to *create, read, update and delete* operations, collectively known as **CRUD**.

### What is SQL?

- **SQL** (usually pronounced like the word “sequel”) stands for Structured Query Language.
- A programming language used to communicate with data stored in a **RDBMS** (relational database management system).
- SQL syntax is similar to the English language, which makes it relatively easy to write, read, and interpret.

### Schema
A relational database schema helps you to organize and understand the structure of a database by showing how all of the tables are related to each other.
<img src='https://github.com/yishuen/studygroups-070620pt/blob/master/mod-1/images/employees-schema.png?raw=1'>

### Relationships

The logical association among entities is called relationship. Relationships are mapped between entities in various ways. 

**Relationship Mappings**

- one to one
- one to many
- many to many

### One to One Relationship
<img src="https://github.com/yishuen/studygroups-070620pt/blob/master/mod-1/images/one-to-one.png?raw=1" >

### One to Many Relationship

This is the most commonly used type of relationship. Consider an e-commerce website, with the following:

Customers can make many orders.
Orders can contain many items.
Items can have descriptions in many languages.
<img src="https://github.com/yishuen/studygroups-070620pt/blob/master/mod-1/images/one-to-many.png?raw=1" >

### Many to Many Relationship

In some cases, you may need multiple instances on both sides of the relationship. For example, each order can contain multiple items. And each item can also be in multiple orders.
<img src="https://github.com/yishuen/studygroups-070620pt/blob/master/mod-1/images/many-to-many.png?raw=1" >

***For these relationships, we need to create an extra table to track the relationships:***

<img src="https://github.com/yishuen/studygroups-070620pt/blob/master/mod-1/images/many-to-many-junction.png?raw=1" >

### SQL Data Types

SQL data types can be broadly divided into following categories.

- Numeric data types such as int, tinyint, bigint, float, real etc.
- Date and Time data types such as Date, Time, Datetime etc.
- Character and String data types such as char, varchar, text etc.
- Unicode character string data types, for example nchar, nvarchar, ntext etc.
- Binary data types such as binary, varbinary etc.
- Miscellaneous data types – clob, blob, xml, cursor, table etc.

<img src="https://github.com/yishuen/studygroups-070620pt/blob/master/mod-1/images/data-type-mapping.png?raw=1" >

#### SQLite Data Types

Any column declared in an SQLite database is assigned a type affinity depending on its declared data type. Here the list of type affinities in SQLite:

- TEXT
- NUMERIC
- INTEGER
- REAL
- BLOB

## Using SQL in Python


We're going to play around with this Pokemon database!

<img src='https://raw.githubusercontent.com/yishuen/studygroups-070620pt/master/mod-1/images/pokemon_db.png'>

In [1]:
import pandas as pd
import sqlite3

In [2]:
# Connecting to the database.
conn = sqlite3.connect('../data/pokemon.db')
conn

In [3]:
# Look at the cursor.
cur = conn.cursor()
cur

In [4]:
# Executing a query.
cur.execute('SELECT * FROM pokemon')

In [5]:
# Showing the description.
cur.description

(('id', None, None, None, None, None, None),
 ('name', None, None, None, None, None, None),
 ('base_experience', None, None, None, None, None, None),
 ('weight', None, None, None, None, None, None),
 ('height', None, None, None, None, None, None))

In [6]:
# Get column names - longhand.
my_lst = []
for x in cur.description:
    my_lst.append(x[0])
my_lst

['id', 'name', 'base_experience', 'weight', 'height']

In [7]:
# Get column names - shorthand.
[x[0] for x in cur.description]

['id', 'name', 'base_experience', 'weight', 'height']

In [8]:
# Return the query.
cur.fetchall()

[(1, 'bulbasaur', 64, 69, 7),
 (2, 'ivysaur', 142, 130, 10),
 (3, 'venusaur', 236, 1000, 20),
 (4, 'charmander', 62, 85, 6),
 (5, 'charmeleon', 142, 190, 11),
 (6, 'charizard', 240, 905, 17),
 (7, 'squirtle', 63, 90, 5),
 (8, 'wartortle', 142, 225, 10),
 (9, 'blastoise', 239, 855, 16),
 (10, 'caterpie', 39, 29, 3),
 (11, 'metapod', 72, 99, 7),
 (12, 'butterfree', 178, 320, 11),
 (13, 'weedle', 39, 32, 3),
 (14, 'kakuna', 72, 100, 6),
 (15, 'beedrill', 178, 295, 10),
 (16, 'pidgey', 50, 18, 3),
 (17, 'pidgeotto', 122, 300, 11),
 (18, 'pidgeot', 216, 395, 15),
 (19, 'rattata', 51, 35, 3),
 (20, 'raticate', 145, 185, 7),
 (21, 'spearow', 52, 20, 3),
 (22, 'fearow', 155, 380, 12),
 (23, 'ekans', 58, 69, 20),
 (24, 'arbok', 157, 650, 35),
 (25, 'pikachu', 112, 60, 4),
 (26, 'raichu', 218, 300, 8),
 (27, 'sandshrew', 60, 120, 6),
 (28, 'sandslash', 158, 295, 10),
 (29, 'nidoran-f', 55, 70, 4),
 (30, 'nidorina', 128, 200, 8),
 (31, 'nidoqueen', 227, 600, 13),
 (32, 'nidoran-m', 55, 90, 5),
 (33, 'nidorino', 128, 195, 9),
 (34, 'nidoking', 227, 620, 14),
 (35, 'clefairy', 113, 75, 6),
 (36, 'clefable', 217, 400, 13),
 (37, 'vulpix', 60, 99, 6),
 (38, 'ninetales', 177, 199, 11),
 (39, 'jigglypuff', 95, 55, 5),
 (40, 'wigglytuff', 196, 120, 10),
 (41, 'zubat', 49, 75, 8),
 (42, 'golbat', 159, 550, 16),
 (43, 'oddish', 64, 54, 5),
 (44, 'gloom', 138, 86, 8),
 (45, 'vileplume', 221, 186, 12),
 (46, 'paras', 57, 54, 3),
 (47, 'parasect', 142, 295, 10),
 (48, 'venonat', 61, 300, 10),
 (49, 'venomoth', 158, 125, 15),
 (50, 'diglett', 53, 8, 2),
 (51, 'dugtrio', 149, 333, 7),
 (52, 'meowth', 58, 42, 4),
 (53, 'persian', 154, 320, 10),
 (54, 'psyduck', 64, 196, 8),
 (55, 'golduck', 175, 766, 17),
 (56, 'mankey', 61, 280, 5),
 (57, 'primeape', 159, 320, 10),
 (58, 'growlithe', 70, 190, 7),
 (59, 'arcanine', 194, 1550, 19),
 (60, 'poliwag', 60, 124, 6),
 (61, 'poliwhirl', 135, 200, 10),
 (62, 'poliwrath', 230, 540, 13),
 (63, 'abra', 62, 195, 9),
 (64, 'kadabra', 140, 565, 13),
 (65, 'alakazam', 225, 480, 15),
 (66, 'machop', 61, 195, 8),
 (67, 'machoke', 142, 705, 15),
 (68, 'machamp', 227, 1300, 16),
 (69, 'bellsprout', 60, 40, 7),
 (70, 'weepinbell', 137, 64, 10),
 (71, 'victreebel', 221, 155, 17),
 (72, 'tentacool', 67, 455, 9),
 (73, 'tentacruel', 180, 550, 16),
 (74, 'geodude', 60, 200, 4),
 (75, 'graveler', 137, 1050, 10),
 (76, 'golem', 223, 3000, 14),
 (77, 'ponyta', 82, 300, 10),
 (78, 'rapidash', 175, 950, 17),
 (79, 'slowpoke', 63, 360, 12),
 (80, 'slowbro', 172, 785, 16),
 (81, 'magnemite', 65, 60, 3),
 (82, 'magneton', 163, 600, 10),
 (83, 'farfetchd', 132, 150, 8),
 (84, 'doduo', 62, 392, 14),
 (85, 'dodrio', 165, 852, 18),
 (86, 'seel', 65, 900, 11),
 (87, 'dewgong', 166, 1200, 17),
 (88, 'grimer', 65, 300, 9),
 (89, 'muk', 175, 300, 12),
 (90, 'shellder', 61, 40, 3),
 (91, 'cloyster', 184, 1325, 15),
 (92, 'gastly', 62, 1, 13),
 (93, 'haunter', 142, 1, 16),
 (94, 'gengar', 225, 405, 15),
 (95, 'onix', 77, 2100, 88),
 (96, 'drowzee', 66, 324, 10),
 (97, 'hypno', 169, 756, 16),
 (98, 'krabby', 65, 65, 4),
 (99, 'kingler', 166, 600, 13),
 (100, 'voltorb', 66, 104, 5),
 (101, 'electrode', 172, 666, 12),
 (102, 'exeggcute', 65, 25, 4),
 (103, 'exeggutor', 186, 1200, 20),
 (104, 'cubone', 64, 65, 4),
 (105, 'marowak', 149, 450, 10),
 (106, 'hitmonlee', 159, 498, 15),
 (107, 'hitmonchan', 159, 502, 14),
 (108, 'lickitung', 77, 655, 12),
 (109, 'koffing', 68, 10, 6),
 (110, 'weezing', 172, 95, 12),
 (111, 'rhyhorn', 69, 1150, 10),
 (112, 'rhydon', 170, 1200, 19),
 (113, 'chansey', 395, 346, 11),
 (114, 'tangela', 87, 350, 10),
 (115, 'kangaskhan', 172, 800, 22),
 (116, 'horsea', 59, 80, 4),
 (117, 'seadra', 154, 250, 12),
 (118, 'goldeen', 64, 150, 6),
 (119, 'seaking', 158, 390, 13),
 (120, 'staryu', 68, 345, 8),
 (121, 'starmie', 182, 800, 11),
 (122, 'mr-mime', 161, 545, 13),
 (123, 'scyther', 100, 560, 15),
 (124, 'jynx', 159, 406, 14),
 (125, 'electabuzz', 172, 300, 11),
 (126, 'magmar', 173, 445, 13),
 (127, 'pinsir', 175, 550, 15),
 (128, 'tauros', 172, 884, 14),
 (129, 'magikarp', 40, 100, 9),
 (130, 'gyarados', 189, 2350, 65),
 (131, 'lapras', 187, 2200, 25),
 (132, 'ditto', 101, 40, 3),
 (133, 'eevee', 65, 65, 3),
 (134, 'vaporeon', 184, 290, 10),
 (135, 'jolteon', 184, 245, 8),
 (136, 'flareon', 184, 250, 9),
 (137, 'porygon', 79, 365, 8),
 (138, 'omanyte', 71, 75, 4),
 (139, 'omastar', 173, 350, 10),
 (140, 'kabuto', 71, 115, 5),
 (141, 'kabutops', 173, 405, 13),
 (142, 'aerodactyl', 180, 590, 18),
 (143, 'snorlax', 189, 4600, 21),
 (144, 'articuno', 261, 554, 17),
 (145, 'zapdos', 261, 526, 16),
 (146, 'moltres', 261, 600, 20),
 (147, 'dratini', 60, 33, 18),
 (148, 'dragonair', 147, 165, 40),
 (149, 'dragonite', 270, 2100, 22),
 (150, 'mewtwo', 306, 1220, 20),
 (151, 'mew', 270, 40, 4)]

In [9]:
# Try to return the query again!
cur.fetchall()

[]

In [10]:
pd.read_sql('SELECT * FROM pokemon', conn)

      id        name  base_experience  weight  height
0      1   bulbasaur               64      69       7
1      2     ivysaur              142     130      10
2      3    venusaur              236    1000      20
3      4  charmander               62      85       6
4      5  charmeleon              142     190      11
..   ...         ...              ...     ...     ...
146  147     dratini               60      33      18
147  148   dragonair              147     165      40
148  149   dragonite              270    2100      22
149  150      mewtwo              306    1220      20
150  151         mew              270      40       4

[151 rows x 5 columns]

### Parts of a SQL Query
* `SELECT ... FROM ...`: Which columns from which table
* `WHERE`: Conditions to filter your query by
* `JOIN`: Put tables together
* `GROUP BY`: Group and aggregate data
* `HAVING`: Filtering after a `GROUP BY`
* `ORDER BY`: How to sort the table
* `LIMIT`: How many rows to query

#### Q1

In [11]:
# Select all pokemon from the pokemon table.
q1 = '''
SELECT *
    FROM pokemon;
'''

# Show results in a pandas dataframe.
pd.read_sql(q1, conn)

      id        name  base_experience  weight  height
0      1   bulbasaur               64      69       7
1      2     ivysaur              142     130      10
2      3    venusaur              236    1000      20
3      4  charmander               62      85       6
4      5  charmeleon              142     190      11
..   ...         ...              ...     ...     ...
146  147     dratini               60      33      18
147  148   dragonair              147     165      40
148  149   dragonite              270    2100      22
149  150      mewtwo              306    1220      20
150  151         mew              270      40       4

[151 rows x 5 columns]

#### Q2

In [12]:
# Select all the rows from pokemon_types where the type_id is 3.
q2 = '''
SELECT *
    FROM pokemon_types
    WHERE type_id = 3
'''

pd.read_sql(q2, conn)

     id  pokemon_id  type_id
0    10           6        3
1    17          12        3
2    25          16        3
3    27          17        3
4    29          18        3
5    33          21        3
6    35          22        3
7    59          41        3
8    61          42        3
9   123          83        3
10  125          84        3
11  127          85        3
12  178         123        3
13  187         130        3
14  205         142        3
15  208         144        3
16  210         145        3
17  212         146        3
18  216         149        3

#### Q3

In [13]:
# Select the rows from pokemon_types where the associated type is "water".
q3 = '''
SELECT pokemon.name as PokemonName, types.name as TypeName
    FROM pokemon_types
    JOIN(types)
        ON pokemon_types.type_id = types.id
    JOIN(pokemon)
        ON pokemon.id = pokemon_types.pokemon_id
    WHERE TypeName = "water"
'''

pd.read_sql(q3, conn)

   PokemonName TypeName
0     squirtle    water
1    wartortle    water
2    blastoise    water
3      psyduck    water
4      golduck    water
5      poliwag    water
6    poliwhirl    water
7    poliwrath    water
8    tentacool    water
9   tentacruel    water
10    slowpoke    water
11     slowbro    water
12        seel    water
13     dewgong    water
14    shellder    water
15    cloyster    water
16      krabby    water
17     kingler    water
18      horsea    water
19      seadra    water
20     goldeen    water
21     seaking    water
22      staryu    water
23     starmie    water
24    magikarp    water
25    gyarados    water
26      lapras    water
27    vaporeon    water
28     omanyte    water
29     omastar    water
30      kabuto    water
31    kabutops    water

---

# Day 2
#### Q4

In [29]:
# Find the average weight for each type.
### Order the results from highest weight to lowest weight.
### Display the type name next to the average weight.
q4 = '''
SELECT types.name as Name, AVG(weight) as AverageWeight
    FROM pokemon
    JOIN pokemon_types
        ON pokemon.id = pokemon_types.pokemon_id
    JOIN types
        ON pokemon_types.type_id = types.id
    GROUP BY types.name
    ORDER BY AverageWeight DESC;
'''

pd.read_sql(q4, conn)

        Name  AverageWeight
0        ice    1137.000000
1       rock     930.454545
2     ground     799.357143
3     dragon     766.000000
4     flying     612.473684
5    psychic     550.071429
6   fighting     542.500000
7      water     536.750000
8     normal     500.863636
9       fire     480.250000
10     steel     330.000000
11  electric     317.888889
12     grass     264.857143
13     fairy     239.000000
14    poison     238.545455
15       bug     229.916667
16     ghost     135.666667

#### Q5

In [52]:
# Find the names and ids of the pokemon that have more than 1 type.
q5 = '''
SELECT pokemon.name as Name, pokemon.id as ID
    FROM pokemon
    JOIN pokemon_types
        ON pokemon.id = pokemon_types.pokemon_id
    GROUP BY name
    HAVING COUNT(name) > 1
    ORDER BY pokemon.id
'''

pd.read_sql(q5, conn)

          Name   ID
0    bulbasaur    1
1      ivysaur    2
2     venusaur    3
3    charizard    6
4   butterfree   12
..         ...  ...
62  aerodactyl  142
63    articuno  144
64      zapdos  145
65     moltres  146
66   dragonite  149

[67 rows x 2 columns]

#### Q6

In [64]:
# Find the id of the type that has the most pokemon. 
### Display type_id next to the number of pokemon having that type.
q6 = '''
SELECT types.name as Name, type_id as TypeID, COUNT(pokemon_id) as NumPokemon
    FROM pokemon
    JOIN pokemon_types
        ON pokemon.id = pokemon_types.pokemon_id
    JOIN types
        ON types.id = pokemon_types.type_id
    GROUP BY type_id
    ORDER BY NumPokemon DESC
    LIMIT 1
'''

pd.read_sql(q6, conn)

     Name  TypeID  NumPokemon
0  poison       4          33